data_rate_all = {
    "C2": {
        "0,4 кВ и ниже": {
            "до 50 мм2": {
                "2.3.1.3.1.1 ВЛ на ж/б изолированным сталеалюминиевым проводом сечением до 50 мм2 включительно одноцепные": 463635.61,
                "2.3.1.4.1.1 ВЛ на ж/б изолированным алюминиевым проводом сечением до 50 мм2 включительно одноцепные": 1478272.10
            },
            "от 400 до 100 мм2": {
                "2.3.1.3.2.1 ВЛ на ж/б изолированным сталеалюминиевым проводом сечением от 50 до 100 мм2 включительно одноцепные": 653055.26,
                "2.3.1.4.2.1 ВЛ на ж/б изолированным алюминиевым проводом сечением от 50 до 100 мм2 включительно одноцепные": 2044555.79,

            }
        },
        "1-20 кВ": {
            "от 100 до 200 мм2": {
                "2.3.1.4.3.1 ВЛ на ж/б изолированным алюминиевым проводом сечением от 100 до 200 мм2 включительно одноцепные": 3659896.65,
            },
        }
    },
    "C3_1": {
        "0,4 кВ и ниже": {
            "до 50 мм2": {
                "бумажная": {
                    "с одним кабелем в траншее": {
                        "3.1.2.2.1.1 КЛ в траншеях многожильные с бумажной изоляцией сечением провода до 50 мм2 включительно с одним кабелем в траншее": 3009220.52
                    }
                }
            }
        },
    }
}


data_rate = {
    "C2": {
        "name_rate": "С2 - Воздушные линии электропередачи",
        "columns": [
            {"header": "№ п/п", "type": "index"},
            {"header": "Напряжение, кВ", "type": "combobox", "key": "voltage"},
            {"header": "Сечение, мм²", "type": "combobox", "key": "section"},
            {"header": "Наименование мероприятия", "type": "optionmenu", "key": "name_rate"},
            {"header": "Стоимость ставки, руб./км", "type": "readonly", "key": "price_rate"},
            {"header": "Длина, км", "type": "float_entry", "key": "value"},
            {"header": "Стоимость без НДС, руб", "type": "readonly", "key": "cost_without_vat"},
            {"header": "Стоимость с НДС, руб", "type": "readonly", "key": "cost_with_vat"}
        ],
        "column_widths": [4, 12, 17, 15, 15, 12, 15, 15]
    },
    "C3_1": {
        "name_rate": "C3_1",
        "columns": [
            {"header": "№ п/п", "type": "index"},
            {"header": "Напряжение, кВ", "type": "combobox", "key": "voltage"},
            {"header": "Сечение, мм²", "type": "combobox", "key": "section"},
            {"header": "Изоляция", "type": "combobox", "key": "insulation"},
            {"header": "Количество КЛ в траншее/блоках/каналах", "type": "combobox", "key": "amount_cabel"},
            {"header": "Наименование мероприятия", "type": "optionmenu", "key": "name_rate"},
            {"header": "Стоимость ставки, руб./км", "type": "readonly", "key": "price_rate"},
            {"header": "Длина, км", "type": "float_entry", "key": "value"},
            {"header": "Стоимость без НДС, руб", "type": "readonly", "key": "cost_without_vat"},
            {"header": "Стоимость с НДС, руб", "type": "readonly", "key": "cost_with_vat"}
        ],
        "column_widths": [4, 12, 17, 15, 15, 15, 15, 12, 15, 15]
    },
}
