rates_dict = {
    "C2": {
        "0,4 кВ и ниже": {
            "до 50 мм2": {
                "2.3.1.3.1.1 ВЛ на ж/б изолированным сталеалюминиевым проводом сечением до 50 мм2 включительно одноцепные": 463635.61,
                "2.3.1.4.1.1 ВЛ на ж/б изолированным алюминиевым проводом сечением до 50 мм2 включительно одноцепные": 1478272.10,
                "2.3.2.4.1.1 ВЛ на ж/б неизолированным алюминиевым проводом сечением до 50 мм2 включительно одноцепные": 463635.61
            }
        }
    },
    "C3_1": {
        "0,4 кВ и ниже": {
            "до 50 мм2": {
                "бумажная": {
                    "с одним кабелем в траншее": {
                        "3.1.2.2.1.1 КЛ в траншеях многожильные с бумажной изоляцией сечением провода до 50 мм2 включительно с одним кабелем в траншее": 3009220.52                    
                    }
                }
            }
        },
        "1-10 кВ": {
            "до 50 мм2": {
                "бумажная": {
                    "с одним кабелем в траншее": {
                        "3.1.2.2.1.1 КЛ в траншеях многожильные с бумажной изоляцией сечением провода до 50 мм2 включительно с одним кабелем в траншее": 2290622.26
                    }
                }
            }
        }
    },
    "C3_2": {
        "0,4 кВ и ниже": {
            "до 50 мм2": {
                "бумажная": {
                    "с одной трубой в скважине": {
                        "3.6.2.2.1.1 КЛ, методом ГНБ, многожильные с бумажной изоляцией сечением провода до 50 мм2 включительно с одной трубой в скважине": 15779376.41
                    }
                }
            }
        },
        "1-10 кВ": {
            "до 50 мм2": {
                "бумажная": {
                    "с одной трубой в скважине": {
                        "3.6.2.2.1.1 КЛ, методом ГНБ, многожильные с бумажной изоляцией сечением провода до 50 мм2 включительно с одной трубой в скважине": 14035451.18
                    }
                }
            }
        }
    },
    "C4": {
        "реклоузеры номинальным током до 100 а включительно": 2187970.59
    },
    "C5": {
        "6/0,4 кВ": {
            "однотрансформаторные": {
                "столбового/мачтового типа": {
                    "до 25 кВА": {
                        "5.1.1.1 однотрансформаторные подстанции (за исключением РТП) мощностью до 25 кВА включительно столбового/мачтового типа": 31960.70
                    }
                },
                "шкафного или киоскового типа": {
                    "до 25 кВА": {
                        "5.1.1.2 однотрансформаторные подстанции (за исключением РТП) мощностью до 25 кВА включительно шкафного или киоскового типа": 34704.41
                    }
                }
            }
        }
    },
    "C8": {
        "0,4 кВ и ниже": {
            "однофазный": {
                "прямого включения": {
                    "8.1.1 средства коммерческого учета электрической энергии (мощности) однофазный прямого включения": 21573.83
                },
            }
        },
        "1-20 кВ": {
            "трехфазный": {
                "прямого включения": {
                    "8.2.1 средства коммерческого учета электрической энергии (мощности) трехфазный прямого включения": 438819.71
                }
            }
        }
    }
}
